bot_writup.org
Machine learn some Dota.
* Introduction
Creating a custom machine learning solution. The obvious step after
writing a custom Dota bot is to teach it to teach itself.
* Distributed Dota as a service
** docker as a function
We needed to run a Dota executable multiple times with different bot
files to determine which set of weights were the most effective in
practice. Docker was the obvious choice. Setting up a docker container
that grabs the Dota and bot files from the local disk was
simple. After some googling and testing we had a way to run a game of
Dota and pipe the output to a file.
#+BEGIN_SRC
FROM fedora:latest
COPY . /scripts
VOLUME /dota
CMD sh /scripts/run_game.sh
#+END_SRC
