bot_writup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-26 Fri 18:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="aren windham" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga274225">1. Introduction</a></li>
<li><a href="#orgce56bd5">2. Distributed Dota as a service</a>
<ul>
<li><a href="#org5e336a8">2.1. docker as a function</a></li>
<li><a href="#orgadda4c5">2.2. parsing game logs</a>
<ul>
<li><a href="#org9124c3c">2.2.1. awk</a></li>
</ul>
</li>
<li><a href="#org5fb59b3">2.3. distributed Dota</a>
<ul>
<li><a href="#org8e0536f">2.3.1. coroutines are cool</a></li>
</ul>
</li>
<li><a href="#orgf8dd1d5">2.4. machine learning</a>
<ul>
<li><a href="#orgac20efd">2.4.1. genetic algorithms</a></li>
<li><a href="#org73b9cc0">2.4.2. awk</a></li>
</ul>
</li>
<li><a href="#org91b1a7b">2.5. distributed Dota</a>
<ul>
<li><a href="#org8158600">2.5.1. coroutines are cool</a></li>
</ul>
</li>
<li><a href="#org40ea826">2.6. machine learning</a>
<ul>
<li><a href="#org50880a1">2.6.1. genetic algorithms</a></li>
<li><a href="#org5635628">2.6.2. awk</a></li>
</ul>
</li>
<li><a href="#orgebce42b">2.7. distributed Dota</a>
<ul>
<li><a href="#org53bc948">2.7.1. coroutines are cool</a></li>
</ul>
</li>
<li><a href="#orgd5986a5">2.8. machine learning</a>
<ul>
<li><a href="#org61456e6">2.8.1. genetic algorithms</a></li>
<li><a href="#orgdb88a86">2.8.2. awk</a></li>
</ul>
</li>
<li><a href="#org4ea44c6">2.9. distributed Dota</a>
<ul>
<li><a href="#org61bb59b">2.9.1. coroutines are cool</a></li>
</ul>
</li>
<li><a href="#orgc58f871">2.10. machine learning</a>
<ul>
<li><a href="#org0d0e8ad">2.10.1. genetic algorithms</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Machine learn some Dota.
</p>
<div id="outline-container-orga274225" class="outline-2">
<h2 id="orga274225"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Creating a custom machine learning solution. The obvious step after
writing a custom Dota bot is to teach it to teach itself.
</p>
</div>
</div>
<div id="outline-container-orgce56bd5" class="outline-2">
<h2 id="orgce56bd5"><span class="section-number-2">2</span> Distributed Dota as a service</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5e336a8" class="outline-3">
<h3 id="org5e336a8"><span class="section-number-3">2.1</span> docker as a function</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We needed to run a Dota executable multiple times with different bot
files to determine which set of weights were the most effective in
practice. Docker was the obvious choice. Setting up a docker container
that grabs the Dota and bot files from the local disk was
simple. After some googling and testing we had a way to run a game of
Dota and pipe the output to a file.
</p>
<pre class="example">
FROM fedora:latest
COPY . /scripts
VOLUME /dota
CMD sh /scripts/run_game.sh
</pre>
</div>
</div>
